var articles = [
    {id: '1',
    title: 'Том Хэнкс готовит к изданию сборник своих рассказов ',
    summary: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories)',
    createdAt: new Date('2016-12-29T23:00:00'),
    author: 'Алина Шеменова',
    content: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.',
    },
    {id: '2',
        title: '5 советов при выборе мебели',
        summary: 'Выбираете мебель и не знаете с чего начать? Многообразие выбора только усложняет и без того нелёгкий процесс поиска? Давайте по порядку.',
        createdAt: new Date('2016-12-14T18:30:00'),
        author: 'Mr. Snow',
        content: 'Выбираете мебель и не знаете с чего начать? Многообразие выбора только усложняет и без того нелёгкий процесс поиска? Давайте по порядку.',
    },
    {id: '3',
        title: 'Криштиану Роналду и Анджелина Джоли снимутся в турецком сериале',
        summary: 'Нападающий испанского футбольного клуба «Реал» Криштиану Роналду и американская актриса Анджелина Джоли снимутся в турецком сериале. Об этом сообщает издании Daily Saban.',
        createdAt: new Date('2017-01-01T20:30:00'),
        author: 'Константин Семенов',
        content: 'Нападающий испанского футбольного клуба «Реал» Криштиану Роналду и американская актриса Анджелина Джоли снимутся в турецком сериале. Об этом сообщает издании Daily Saban.',
    },
    {id: '4',
        title: 'Том Хэнкс готовит к изданию сборник своих рассказов ',
        summary: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories)',
        createdAt: new Date('2016-12-28T23:00:00'),
        author: 'Алина Шеменова',
        content: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.',
    },
    {id: '5',
        title: '5 советов при выборе мебели',
        summary: 'Выбираете мебель и не знаете с чего начать? Многообразие выбора только усложняет и без того нелёгкий процесс поиска? Давайте по порядку.',
        createdAt: new Date('2016-12-29T18:30:00'),
        author: 'Алина Шеменова',
        content: 'Выбираете мебель и не знаете с чего начать? Многообразие выбора только усложняет и без того нелёгкий процесс поиска? Давайте по порядку.',
    },
    {id: '6',
        title: 'Криштиану Роналду и Анджелина Джоли снимутся в турецком сериале',
        summary: 'Нападающий испанского футбольного клуба «Реал» Криштиану Роналду и американская актриса Анджелина Джоли снимутся в турецком сериале. Об этом сообщает издании Daily Saban.',
        createdAt: new Date('2017-01-10T20:30:00'),
        author: 'Константин Семенов',
        content: 'Нападающий испанского футбольного клуба «Реал» Криштиану Роналду и американская актриса Анджелина Джоли снимутся в турецком сериале. Об этом сообщает издании Daily Saban.',
    },
    {id: '7',
        title: 'Том Хэнкс готовит к изданию сборник своих рассказов ',
        summary: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories)',
        createdAt: new Date('2016-12-01T23:00:00'),
        author: 'Алина Шеменова',
        content: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.',
    },
    {id: '8',
        title: '5 советов при выборе мебели',
        summary: 'Выбираете мебель и не знаете с чего начать? Многообразие выбора только усложняет и без того нелёгкий процесс поиска? Давайте по порядку.',
        createdAt: new Date('2016-12-23T18:30:00'),
        author: 'Mr. Snow',
        content: 'Выбираете мебель и не знаете с чего начать? Многообразие выбора только усложняет и без того нелёгкий процесс поиска? Давайте по порядку.',
    },
    {id: '9',
        title: 'Криштиану Роналду и Анджелина Джоли снимутся в турецком сериале',
        summary: 'Нападающий испанского футбольного клуба «Реал» Криштиану Роналду и американская актриса Анджелина Джоли снимутся в турецком сериале. Об этом сообщает издании Daily Saban.',
        createdAt: new Date('2017-02-18T20:30:00'),
        author: 'Константин Семенов',
        content: 'Нападающий испанского футбольного клуба «Реал» Криштиану Роналду и американская актриса Анджелина Джоли снимутся в турецком сериале. Об этом сообщает издании Daily Saban.',
    },
    {id: '10',
        title: 'Том Хэнкс готовит к изданию сборник своих рассказов',
        summary: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories)',
        createdAt: new Date('2016-12-09T23:00:00'),
        author: 'Mr. Snow',
        content: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.',
    },
    {id: '11',
        title: '5 советов при выборе мебели',
        summary: 'Выбираете мебель и не знаете с чего начать? Многообразие выбора только усложняет и без того нелёгкий процесс поиска? Давайте по порядку.',
        createdAt: new Date('2016-01-19T18:30:00'),
        author: 'Алина Шеменова',
        content: 'Выбираете мебель и не знаете с чего начать? Многообразие выбора только усложняет и без того нелёгкий процесс поиска? Давайте по порядку.',
    },
    {id: '12',
        title: 'Криштиану Роналду и Анджелина Джоли снимутся в турецком сериале ',
        summary: 'Нападающий испанского футбольного клуба «Реал» Криштиану Роналду и американская актриса Анджелина Джоли снимутся в турецком сериале. Об этом сообщает издании Daily Saban.',
        createdAt: new Date('2017-01-07T20:30:00'),
        author: 'Mr. Snow',
        content: 'Нападающий испанского футбольного клуба «Реал» Криштиану Роналду и американская актриса Анджелина Джоли снимутся в турецком сериале. Об этом сообщает издании Daily Saban.',
    },
    {id: '13',
        title: 'Криштиану Роналду и Анджелина Джоли снимутся в турецком сериале',
        summary: 'Нападающий испанского футбольного клуба «Реал» Криштиану Роналду и американская актриса Анджелина Джоли снимутся в турецком сериале. Об этом сообщает издании Daily Saban.',
        createdAt: new Date('2017-03-01T20:00:00'),
        author: 'Константин Семенов',
        content: 'Нападающий испанского футбольного клуба «Реал» Криштиану Роналду и американская актриса Анджелина Джоли снимутся в турецком сериале. Об этом сообщает издании Daily Saban.',
    },
    {id: '14',
        title: 'Попытка №4. Минское "Динамо" спустя два года вновь сыграет в плей-офф КХЛ ',
        summary: 'Минское «Динамо» начинает сегодня четвертую в своей истории серию плей-офф Континентальной хоккейной лиги.',
        createdAt: new Date('2017-03-03T20:00:00'),
        author: 'Антон Базанов',
        content: 'Минское «Динамо» начинает сегодня четвертую в своей истории серию плей-офф Континентальной хоккейной лиги. NewsPortal рассказывает, чего ждать от противостояния с «Локомотивом», а также сравнивает нынешних «зубров» с предыдущими составами, выходившими в плей-офф.',
    },
    {id: '15',
        title: '5 советов при выборе мебели',
        summary: 'Выбираете мебель и не знаете с чего начать? Многообразие выбора только усложняет и без того нелёгкий процесс поиска? Давайте по порядку.',
        createdAt: new Date('2016-10-10T18:30:00'),
        author: 'Валентина Сабольская',
        content: 'Выбираете мебель и не знаете с чего начать? Многообразие выбора только усложняет и без того нелёгкий процесс поиска? Давайте по порядку.',
    },
    {id: '16',
        title: 'Том Хэнкс готовит к изданию сборник своих рассказов ',
        summary: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories)',
        createdAt: new Date('2016-01-28T23:30:00'),
        author: 'Екатерина Лаврова',
        content: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.',
    },
    {id: '17',
        title: 'Команда Беларуси завоевала 16 медалей на Кубке мира по зимнему плавани',
        summary: 'Сборная Беларуси завоевала 16 медалей на Кубке мира по зимнему плаванию в столице Эстонии Таллине. Турнир прошел 4−5 марта 2017 г.',
        createdAt: new Date('2017-03-05T18:30:00'),
        author: 'Mr. Snow',
        content: 'Сборная Беларуси завоевала 16 медалей на Кубке мира по зимнему плаванию в столице Эстонии Таллине. Турнир прошел 4−5 марта 2017 г.',
    },
    {id: '18',
        title: 'Команда Беларуси завоевала 16 медалей на Кубке мира по зимнему плавани',
        summary: 'Сборная Беларуси завоевала 16 медалей на Кубке мира по зимнему плаванию в столице Эстонии Таллине. Турнир прошел 4−5 марта 2017 г.',
        createdAt: new Date('2017-03-05T20:30:00'),
        author: 'Валентина Сабольская',
        content: 'Сборная Беларуси завоевала 16 медалей на Кубке мира по зимнему плаванию в столице Эстонии Таллине. Турнир прошел 4−5 марта 2017 г.',
    },
    {id: '19',
        title: 'Том Хэнкс готовит к изданию сборник своих рассказов ',
        summary: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories)',
        createdAt: new Date('2016-02-01T02:17:00'),
        author: 'Алина Шеменова',
        content: 'Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.Американский актер Том Хэнкс в октябре выпустит сборник своих рассказов под названием «Истории о незаурядных пишущих машинках» (Uncommon Type: Some Stories). Как сообщил сам автор, он работал над книгой в течение двух лет.',
    },
    {id: '20',
        title: 'Команда Беларуси завоевала 16 медалей на Кубке мира по зимнему плавани',
        summary: 'Сборная Беларуси завоевала 16 медалей на Кубке мира по зимнему плаванию в столице Эстонии Таллине. Турнир прошел 4−5 марта 2017 г.',
        createdAt: new Date('2017-03-05T18:30:00'),
        author: 'Константин Семенов',
        content: 'Сборная Беларуси завоевала 16 медалей на Кубке мира по зимнему плаванию в столице Эстонии Таллине. Турнир прошел 4−5 марта 2017 г.',
    },
];
var maxId = articles.length;

function getArticles(skip,top, filterConfig) {
   skip = skip || 0;
   top = top || 10;
   filterConfig = filterConfig || {};
   var _articles;
   if(filterConfig.author !== undefined) {
       _articles = articles.filter(function (article) {
           return article.author === filterConfig.author;
       })
   }
   else{
       _articles=articles;
   }
   _articles.sort(function (a,b) {
       return a.createdAt - b.createdAt;
   })
    return _articles.slice(skip,top+skip);
};

function getArticle( id ){
    id = id || null;
    var article;
    if(typeof id == 'string'){
    if( id !== null) {
        for (var i = 0; i < articles.length; i++) {
            if (id.localeCompare(articles[i].id) == 0) {
                return article = articles[i];
            }
        }
    }
    }
}

function validateArticle( article) {
    article = article || {};
    var bool;
    if('id' in article == true){
        if(typeof article.id !== 'string'){
            return  false;
        }
    }
    else{
        return false;
    }

    if('title' in article == true){
        if(typeof article.title !== 'string' || article.title.length > 100){
            return false;
        }
    }
    else{
        return false;
    }
    if('summary' in article == true){
        if(typeof article.summary !== 'string' || article.summary.length > 200){
            return false;
        }
    }
    else{
        return false;
    }
    if('createdAt' in article == true){
        if((article.createdAt instanceof Date) == false){
            return false;
        }
    }
    else{
        return false;
    }

    if('author' in article == true){
        if(typeof article.author !== 'string'){
            return  false;
        }
    }
    else{
        return false;
    }

    if('content' in article == true){
        if(typeof article.content !== 'string'){
            return  false;
        }
    }
    else{
        return  false;
    }
    return true;
}

function editArticle( id , article) {
    id = id || null;
    article = article || {};
    var index;
    for(var i=0; i< articles.length; i++){
        if(id == articles[i].id) {
            index = i;
            if (validateArticle(articles[i]) == true) {
                if (article.title !== undefined) {
                    articles[i].title = article.title;
                }
                if (article.summary !== undefined) {
                    articles[i].summary = article.summary;
                }
                if (article.content !== undefined) {
                    articles[i].content = article.content;
                }
                return true;
            }
            else{
                return false;
            }
        }
    }
}

function removeArticle( id) {
    id = id || null;
    var _articles;
    for(var i=0; i< articles.length; i++){
        if(id == articles[i].id){
            articles.splice( i,1);
            return true;
        }
    }
    return false;
}

function  addArticle(article) {
    article = article || {};
    article.id = (maxId+1)+'';
    if(validateArticle(article) == true){
        articles.splice(articles.length,0,article);
        maxId++;
       // console.log(getArticle(maxId + ''))
        return true;
    }
    else {
        return false;
    }
}



console.log(editArticle('1', {
    title : 'azazaza',
    summary: 'sasaylalka'
}));
console.log(getArticle('1'));


console.log(getArticles(0,3,{ author: 'Mr. Snow'}));

console.log(getArticle('7'));

console.log(validateArticle(articles[4]));

console.log(removeArticle('3'));
console.log(articles);

console.log(addArticle({
    title: 'new title',
    summary: 'new summary',
    createdAt: new Date('2016-12-23T18:30:00'),
    author: 'Tom',
    content: 'new content',
}));
console.log(articles);
